brew "bat"
brew "direnv"
brew "docker"
brew "eza"
brew "fnm"
brew "fzf"
brew "gh"
brew "git-crypt"
brew "gnupg"
brew "go"
brew "jj"
brew "neovim"
brew "nushell"
brew "ripgrep"
brew "starship"
brew "tmux"
brew "zellij"
brew "zoxide"
cask "legcord"
cask "ghostty"
