# CLI tools
brew "ast-grep"
brew "atuin"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "bat"
brew "carapace"
# claude-code: install via npm (npm install -g @anthropic-ai/claude-code)
brew "coreutils"
brew "curl"
brew "direnv"
brew "docker"
brew "eza"
brew "findutils"
brew "fnm"
brew "fzf"
brew "gh"
brew "git"
brew "git-crypt"
brew "git-lfs"
brew "make"
brew "gnupg"
brew "gnu-sed"
brew "go"
brew "jj"
brew "jq"
brew "just"
brew "ncurses"
brew "neovim"
brew "node@22"
brew "nushell"
brew "pinentry-mac"
brew "python@3.12"
brew "ripgrep"
brew "the_silver_searcher"
brew "sshuttle"
brew "starship"
brew "tmux"
brew "tree"
brew "uv"
brew "watch"
brew "yarn"
brew "zellij"
brew "zoxide"
brew "zsh"
brew "zsh-completions"

brew "dmmulroy/tap/jj-starship"
brew "rselbach/tap/jwtdebug"

# Casks
cask "1password"
cask "ghostty"
cask "legcord"
cask "visual-studio-code"

# Fonts
cask "font-jetbrains-mono-nerd-font"
